BreadBoardMates/C-Mates-Controller/examples/MPLAB Express (PIC16F18855)/Various Digits.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.7
        Device            :  PIC16F18855
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.31 and above
        MPLAB 	          :  MPLAB X 5.45	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set ERR aliases
#define ERR_TRIS                 TRISAbits.TRISA0
#define ERR_LAT                  LATAbits.LATA0
#define ERR_PORT                 PORTAbits.RA0
#define ERR_WPU                  WPUAbits.WPUA0
#define ERR_OD                   ODCONAbits.ODCA0
#define ERR_ANS                  ANSELAbits.ANSA0
#define ERR_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define ERR_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define ERR_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define ERR_GetValue()           PORTAbits.RA0
#define ERR_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define ERR_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define ERR_SetPullup()          do { WPUAbits.WPUA0 = 1; } while(0)
#define ERR_ResetPullup()        do { WPUAbits.WPUA0 = 0; } while(0)
#define ERR_SetPushPull()        do { ODCONAbits.ODCA0 = 0; } while(0)
#define ERR_SetOpenDrain()       do { ODCONAbits.ODCA0 = 1; } while(0)
#define ERR_SetAnalogMode()      do { ANSELAbits.ANSA0 = 1; } while(0)
#define ERR_SetDigitalMode()     do { ANSELAbits.ANSA0 = 0; } while(0)

// get/set RST aliases
#define RST_TRIS                 TRISBbits.TRISB1
#define RST_LAT                  LATBbits.LATB1
#define RST_PORT                 PORTBbits.RB1
#define RST_WPU                  WPUBbits.WPUB1
#define RST_OD                   ODCONBbits.ODCB1
#define RST_ANS                  ANSELBbits.ANSB1
#define RST_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define RST_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define RST_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define RST_GetValue()           PORTBbits.RB1
#define RST_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define RST_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define RST_SetPullup()          do { WPUBbits.WPUB1 = 1; } while(0)
#define RST_ResetPullup()        do { WPUBbits.WPUB1 = 0; } while(0)
#define RST_SetPushPull()        do { ODCONBbits.ODCB1 = 0; } while(0)
#define RST_SetOpenDrain()       do { ODCONBbits.ODCB1 = 1; } while(0)
#define RST_SetAnalogMode()      do { ANSELBbits.ANSB1 = 1; } while(0)
#define RST_SetDigitalMode()     do { ANSELBbits.ANSB1 = 0; } while(0)

// get/set RC5 procedures
#define RC5_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define RC5_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define RC5_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define RC5_GetValue()              PORTCbits.RC5
#define RC5_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define RC5_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define RC5_SetPullup()             do { WPUCbits.WPUC5 = 1; } while(0)
#define RC5_ResetPullup()           do { WPUCbits.WPUC5 = 0; } while(0)
#define RC5_SetAnalogMode()         do { ANSELCbits.ANSC5 = 1; } while(0)
#define RC5_SetDigitalMode()        do { ANSELCbits.ANSC5 = 0; } while(0)

// get/set RC6 procedures
#define RC6_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define RC6_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define RC6_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define RC6_GetValue()              PORTCbits.RC6
#define RC6_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define RC6_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define RC6_SetPullup()             do { WPUCbits.WPUC6 = 1; } while(0)
#define RC6_ResetPullup()           do { WPUCbits.WPUC6 = 0; } while(0)
#define RC6_SetAnalogMode()         do { ANSELCbits.ANSC6 = 1; } while(0)
#define RC6_SetDigitalMode()        do { ANSELCbits.ANSC6 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/